# <font color="purple"><h3 align="center">Dataframe and mysql database tutorial</h3></font>

In [20]:
import pandas as pd
import sqlalchemy
import pymysql

In [21]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:test123$@localhost:3306/work_schema')

Format of connection string is:

mysql+pymysql://username:password@host:port/database_name

Format of connection string for other databases

https://pandas.pydata.org/pandas-docs/stable/io.html#engine-connection-examples

<img src="conn_string_format.JPG"/>

<h3 style="color:purple">Read entire table in a dataframe using <span style="color:blue">read_sql_table</span></h3>

In [22]:
df = pd.read_sql_table('customers',engine)
df

   id    name phone_number
0   1  Donald   1234567890
1   2    Bill   2345678901
2   3    Modi   3456789012

**Read only selected columns**

In [23]:
df = pd.read_sql_table('customers', engine, columns=["name"])
df

     name
0  Donald
1    Bill
2    Modi

<h3 style="color:purple">Join two tables and read them in a dataframe using <span style="color:blue">read_sql_query</span></h3>

In [24]:
df = pd.read_sql_query("select id,name from customers",engine)
df

   id    name
0   1  Donald
1   2    Bill
2   3    Modi

In [28]:
query = '''
 SELECT customers.name, customers.phone_number, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''
df = pd.read_sql_query(query,engine)
df

     name phone_number          name  amount
0  Donald   1234567890  Google Pixel     950
1    Bill   2345678901      Yoga Mat      20
2    Modi   3456789012  Fossil Watch     120

<h3 style="color:purple"><span style="color:blue">read_sql</span> is a wrapper around read_sql_query and read_sql_table</h3>

In [29]:
query = '''
 SELECT customers.name, customers.phone_number, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''
pd.read_sql(query,engine)

     name phone_number          name  amount
0  Donald   1234567890  Google Pixel     950
1    Bill   2345678901      Yoga Mat      20
2    Modi   3456789012  Fossil Watch     120

In [30]:
pd.read_sql("customers",engine)

   id    name phone_number
0   1  Donald   1234567890
1   2    Bill   2345678901
2   3    Modi   3456789012

<h3 style="color:purple">Write to mysql database using <span style="color:blue">to_sql</span></h3>

In [31]:
df = pd.read_csv("customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [32]:
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace=True)
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [34]:
df.to_sql(
    name='customers', # database table name
    con=engine,
    if_exists='append',
    index=False
)
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

**to_sql has different parameters such as chunksize which allows to write data in chunks. This is useful when 
size of dataframe is huge**